imp/build/docs/test/AppSpec.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-30 Fri 10:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Test Suite For Web-App-Haskell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Atreyee" />
</head>
<body>
<div id="content">
<h1 class="title">Test Suite For Web-App-Haskell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgab0b8db">1. Language Extensions and Imports</a></li>
<li><a href="#orgd478fb2">2. Sample Data For Tests</a></li>
<li><a href="#org8f9f342">3. Functions To Query UserAPI</a></li>
<li><a href="#orga924a88">4. Test Suite - Main</a></li>
<li><a href="#org0416156">5. Run Test Suite</a></li>
<li><a href="#orgf767807">6. Tangling</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgab0b8db" class="outline-2">
<h2 id="orgab0b8db"><span class="section-number-2">1</span> Language Extensions and Imports</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-haskell" id="orgd3c2981">{-# LANGUAGE DataKinds #-}
{-# LANGUAGE DeriveGeneric #-}
{-# LANGUAGE TypeOperators #-}


module AppSpec where


import Data.Aeson
import Data.Proxy 
import Data.Text

import Database.Persist.Sql

import GHC.Generics

import Control.Exception 
import Control.Monad.Trans.Except

import Network.HTTP.Client
import Network.Wai.Handler.Warp
 
import Servant.API
import Servant.Client
import Servant.Server

import App
import Models
import Api
import Role

import Test.Hspec
import Test.Mockery.Directory
import Test.QuickCheck
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd478fb2" class="outline-2">
<h2 id="orgd478fb2"><span class="section-number-2">2</span> Sample Data For Tests</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-haskell" id="orgb1bcd30">-- sample data set to be used for testing


-- to create a value of Session datatype
createSession :: Integer -&gt; String -&gt; Role -&gt; Session
createSession id email role = Session (toSqlKey $ fromInteger id) email role


-- to create a value of User datatype
createUser :: String -&gt; String -&gt; Role -&gt; User
createUser name email role = User name email role


-- to create a value of Maybe ResponseSessionId datatype
sessionResponse :: Integer -&gt; Maybe ResponseSessionId
sessionResponse x = Just $ ResponseSessionId (toSqlKey $ fromInteger x)


-- to create a value of Maybe ResponseUserId datatype
userResponse :: Integer -&gt; Maybe ResponseUserId
userResponse x = Just $ ResponseUserId (toSqlKey $ fromInteger x)


-- data for user admin-user
adminOneData :: User
adminOneData = createUser "admin-user" "admin@email.com" Admin


-- session for user admin-user
adminOneSession :: Session
adminOneSession = createSession 1 "admin@email.com" Admin


-- user to add
userOneData :: User
userOneData = createUser "small-cat" "small@cat.com" NonAdmin


-- session for user small-cat
userOneSession :: Session
userOneSession = createSession 2 "small@cat.com" NonAdmin


-- another user to add
userTwoData :: User
userTwoData = createUser "large-cat" "large@cat.com" NonAdmin
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f9f342" class="outline-2">
<h2 id="org8f9f342"><span class="section-number-2">3</span> Functions To Query UserAPI</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-haskell" id="orgbb0c909">-- query function types
testIndex :: ClientM Text
testLogin :: Session -&gt; ClientM (Maybe (ResponseSessionId))
testShowUsers :: Maybe (String) -&gt;  ClientM [User]
testAddUser :: Maybe (String) -&gt; User -&gt; ClientM (Maybe (ResponseUserId))
testDeleteUser :: Maybe (String) -&gt; UniqueUserData -&gt; ClientM (Maybe (User))
testLogout :: Maybe (String) -&gt; Session -&gt; ClientM (Maybe (Session))


-- a proxy to our API
userAPI :: Data.Proxy.Proxy UserAPI
userAPI = Data.Proxy.Proxy


-- code that returns the client functions for our API
(testIndex :&lt;|&gt; testLogin) :&lt;|&gt; (testLogout) :&lt;|&gt; (testShowUsers :&lt;|&gt; testAddUser :&lt;|&gt; testDeleteUser) = client userAPI
</pre>
</div>
</div>
</div>

<div id="outline-container-orga924a88" class="outline-2">
<h2 id="orga924a88"><span class="section-number-2">4</span> Test Suite - Main</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell" id="org6f04018">spec :: Spec
spec = do
  around withApp $ do


    describe "/index" $ do
      it "Returns value from Index page" $ \ port -&gt; do
        (tryQuery port testIndex) `shouldReturn` pack("Welcome to User Directory")


    describe "/login" $ do
      
      it "Operates successfully" $ \ port -&gt; do
        (tryQuery port $ testLogin adminOneSession) `shouldReturn` (sessionResponse 1)

      it "Attempts to login an user not in the system" $ \ port -&gt; do
        (tryQuery port $ testLogin userOneSession) `shouldReturn` Nothing
        

    describe "/addUser" $ do

      it "Operates successfully" $ \ port -&gt; do
        -- login an Admin user who can add users
        tryQuery port $ testLogin adminOneSession
        -- adds an user
        (tryQuery port $ testAddUser (Just "1") userOneData) `shouldReturn` (userResponse 2)

      it "Only Admin user can add user" $ \ port -&gt; do
        -- login Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- add NonAdmin user using credentials of "admin-user"
        tryQuery port $ testAddUser (Just "1") userOneData 
       -- login NonAdmin user "small-cat"
        tryQuery port $ testLogin userOneSession
        -- test-add user using credentials of "small-cat"
        (tryQuery port $ testAddUser (Just "2") userTwoData) `shouldThrow` anyErrorCall

      it "Adding user when Session is not present in database" $ \ port -&gt; do
        (tryQuery port $ testAddUser (Just "1") userOneData) `shouldThrow` anyErrorCall


    describe "/deleteUser" $ do

      it "Deletes user successfully" $ \ port -&gt; do
        -- to login "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- to add an user
        tryQuery port $ testAddUser (Just "1") userOneData
        -- to delete same user using credentials of "admin-user"
        (tryQuery port $ testDeleteUser (Just "1") (UniqueUserData "small@cat.com")) `shouldReturn` (Just userOneData)

      it "Only Admin user can delete user" $ \ port -&gt; do
        -- login Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- add NonAdmin user using credentials of "admin-user"
        tryQuery port $ testAddUser (Just "1") userOneData 
       -- login NonAdmin user "small-cat"
        tryQuery port $ testLogin userOneSession
        -- test-delete user using credentials of "small-cat"
        (tryQuery port $ testDeleteUser (Just "2") (UniqueUserData "admin@email.com")) `shouldThrow` anyException

      it "Cannot delete oneself" $ \ port -&gt; do
        -- login Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- Admin user attempts to delete self
        (tryQuery port $ testDeleteUser (Just "1") (UniqueUserData "admin@email.com")) `shouldThrow` anyException

      it "Delete when Session not present in database" $ \ port -&gt; do
        -- login Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- add user to database using credentials of "admin-user"
        tryQuery port $ testAddUser (Just "1") userOneData
        -- test delete user using credentials of non-logged-in user
        (tryQuery port $ testDeleteUser (Just "3") (UniqueUserData "admin@email.com")) `shouldThrow` anyException


    describe "/showUsers" $ do

      it "Shows list of three users successfully" $ \ port -&gt; do
        -- login Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- add user "small-cat"
        tryQuery port $ testAddUser (Just "1") userOneData
        -- add user "large-cat"
        tryQuery port $ testAddUser (Just "1") userTwoData
        -- test-show all users using credentials of "admin-user"
        (tryQuery port $ testShowUsers (Just "1")) `shouldReturn` [adminOneData, userOneData, userTwoData]

      it "Cannot access list of users when session not in database" $ \ port -&gt; do
        (tryQuery port $ testShowUsers (Just "1")) `shouldThrow` anyException
        

    describe "/logout" $ do

      it "Logs out user successfully" $ \ port -&gt; do
        -- to log in user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- test-log out user "admin-user" using own credentials
        (tryQuery port $ testLogout (Just "1") adminOneSession) `shouldReturn` (Just adminOneSession)

      it "Cannot log out when session not in database" $ \ port -&gt; do
        -- test-log out random user not logged-in
        (tryQuery port $ testLogout (Just "1") adminOneSession) `shouldThrow` anyException

      it "Cannot log out non-self user" $ \ port -&gt; do
        -- log in Admin user "admin-user"
        tryQuery port $ testLogin adminOneSession
        -- add user "small-cat"
        tryQuery port $ testAddUser (Just "1") userOneData
        -- log in user "small-cat"
        tryQuery port $ testLogin userOneSession
        -- log out "admin-user" using credentials of "small-cat"
        (tryQuery port $ testLogout (Just "2") adminOneSession) `shouldThrow` anyException
</pre>
</div>
</div>
</div>
<div id="outline-container-org0416156" class="outline-2">
<h2 id="org0416156"><span class="section-number-2">5</span> Run Test Suite</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-haskell" id="orgabb33da">withApp :: (Int -&gt; IO a) -&gt; IO a
withApp action =
  inTempDirectory $ do
    app &lt;- mkApp "sqlite.db"
    testWithApplication (return app) action


errorText :: Text
errorText = pack("Error")


tryQuery port query = do
  manager &lt;- newManager defaultManagerSettings
  res &lt;- runClientM query (ClientEnv manager (BaseUrl Http "localhost" port ""))
  case res of
    Left err -&gt; throwIO $ ErrorCall $ show err
    Right xs -&gt; return xs
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf767807" class="outline-2">
<h2 id="orgf767807"><span class="section-number-2">6</span> Tangling</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-haskell" id="org26943a1">&lt;&lt;extns_and_imports&gt;&gt;
&lt;&lt;sample_data&gt;&gt;
&lt;&lt;query_functions&gt;&gt;
&lt;&lt;test_suite_main&gt;&gt;
&lt;&lt;run_test_suite&gt;&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Atreyee</p>
<p class="date">Created: 2017-06-30 Fri 10:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
